Show / Hide Table of Contents
Class CutBeamByBeamData
Provides data of the cut objec by object
Inheritance
System.Object
CutBeamByBeamData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class CutBeamByBeamData
Properties
Improve this Doc   View Source
CuttingObject
Cutting by object
Declaration
public ReferenceElement CuttingObject { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
IsWeld
is cut welded
Declaration
public bool IsWeld { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Method
Cut Method For cut beam by neagtive object is reqied method Surface
Declaration
public CutMethod Method { get; set; }
Property Value
 Type |  Description
 CutMethod
Improve this Doc   View Source
ModifiedObject
Modified object
Declaration
public ReferenceElement ModifiedObject { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Offset
Offset
Declaration
public double Offset { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Orientation
Cut Orientation
Declaration
public CutOrientation Orientation { get; set; }
Property Value
 Type |  Description
 CutOrientation
Improve this Doc   View Source
PlaneOnCuttingObject
PlaneOnCuttingObject
Declaration
public DistanceComparison PlaneOnCuttingObject { get; set; }
Property Value
 Type |  Description
 DistanceComparison
Improve this Doc   View Source
WeldThickness
Thickness of the weld - value 0 = recommended size
Declaration
public double WeldThickness { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WeldType
Type of the weld
Declaration
public WeldType WeldType { get; set; }
Property Value
 Type |  Description
 WeldType
 Improve this Doc
 View Source